In [3]:
import pandas as pd

 ### Creating panda's Series from Python list

In [4]:
contries=['IND','CHN','USA','RUS']
index=[0,1,2,3]

In [5]:
my_series1=pd.Series(contries,index)

In [6]:
print(my_series1)

0    IND
1    CHN
2    USA
3    RUS
dtype: object

In [7]:
type(my_series1)

pandas.core.series.Series

- Here Index axis is optional

### Creating panda's Series from Python Dictionary

In [8]:
my_dictionary={'name':'Manoj','gender':'male','ocupation':'Engineer'}

In [9]:
my_series2=pd.Series(my_dictionary)
print(my_series2)

name            Manoj
gender           male
ocupation    Engineer
dtype: object

### Grabbing information from Series

In [10]:
my_series1[0]

'IND'

In [11]:
my_series2['name']

'Manoj'

In [12]:
my_series1[1]

'CHN'

In [13]:
my_series3=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [14]:
my_series3['Manoj']

1

### Performing Arithmetic operations on Series

In [15]:
Series1=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [16]:
Series2=pd.Series([1,2,3,4],['Kumar','Male','Engineer','Delhi'])

In [17]:
Series1-Series2 #NaN -Not a number

Delhi       NaN
Engineer    0.0
Kumar       NaN
MZn         NaN
Male        0.0
Manoj       NaN
dtype: float64

In [18]:
Series1+Series2

Delhi       NaN
Engineer    6.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [19]:
Series1*Series2

Delhi       NaN
Engineer    9.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [20]:
Series1/Series2

Delhi       NaN
Engineer    1.0
Kumar       NaN
MZn         NaN
Male        1.0
Manoj       NaN
dtype: float64

### DataFrames

In [21]:
# Basic Syntax to creating Data frame:
#pd.DataFrame(data,index)

In [22]:
# Data Frame of Random Number having 5 Rows and 4 column:
import numpy as np
df=pd.DataFrame(np.random.random((5,4)),['A','B','C','D','E'],['W','X','Y','Z'])

In [23]:
df

          W         X         Y         Z
A  0.293128  0.210182  0.881579  0.159444
B  0.097282  0.166132  0.448567  0.523679
C  0.512189  0.756732  0.370658  0.471064
D  0.548625  0.540389  0.769981  0.021855
E  0.208931  0.119803  0.686431  0.366135

#here each column is a panda series which is sharing a same index means DF is a collection of Series sharing the same Index.

#### Creating DataFrame from a dictionary Of Series.

In [24]:
my_dict={'Name':pd.Series(['AA','BB','CC','DD'],index=[0,1,2,3]),
         'Age': pd.Series([15,20,25,30],index=[0,1,2,3]),
        'Gender':pd.Series(['M','F','F','M'],index=[0,1,2,3])}

In [25]:
pd.DataFrame(my_dict)

  Name  Age Gender
0   AA   15      M
1   BB   20      F
2   CC   25      F
3   DD   30      M

#### Creating DataFrame from a dictionary Of list.

In [26]:
my_dict1={'Name':['Manoj','SAN','JAM','OPO'],
    'Age':[20,25,30,35],
    'Year':[2012,2013,2014,2015] 
   }

In [27]:
my_df1=pd.DataFrame(my_dict1,index=[0,1,2,3])

In [28]:
my_df1

    Name  Age  Year
0  Manoj   20  2012
1    SAN   25  2013
2    JAM   30  2014
3    OPO   35  2015

In [29]:
my_df1= pd.DataFrame(my_dict1,index=[0,1,2,3])
my_df1

    Name  Age  Year
0  Manoj   20  2012
1    SAN   25  2013
2    JAM   30  2014
3    OPO   35  2015

### Selecting Columns from DataFrames

In [30]:
my_df1['Age'] # As We choose a column having same index so output is a series

0    20
1    25
2    30
3    35
Name: Age, dtype: int64

In [31]:
type(my_df1['Age'])

pandas.core.series.Series

### If we grab multiple columns, the result will be a DataFrame:

In [32]:
    my_df1[['Name','Year']]

    Name  Year
0  Manoj  2012
1    SAN  2013
2    JAM  2014
3    OPO  2015

In [33]:
pd.DataFrame(my_dict1)

    Name  Age  Year
0  Manoj   20  2012
1    SAN   25  2013
2    JAM   30  2014
3    OPO   35  2015

In [34]:
my_dict1['Nationality']=pd.Series(['IND','USA','CHN','JPN'],index=[0,1,2,3])

In [35]:
my_df2=pd.DataFrame(my_dict1)
print(my_df2)
my_df2

    Name  Age  Year Nationality
0  Manoj   20  2012         IND
1    SAN   25  2013         USA
2    JAM   30  2014         CHN
3    OPO   35  2015         JPN

    Name  Age  Year Nationality
0  Manoj   20  2012         IND
1    SAN   25  2013         USA
2    JAM   30  2014         CHN
3    OPO   35  2015         JPN

#### Removing rows/columns from a DataFrame

In [36]:
my_df2.drop('Year',axis=1) # TO delete the column

    Name  Age Nationality
0  Manoj   20         IND
1    SAN   25         USA
2    JAM   30         CHN
3    OPO   35         JPN

In [37]:
# To delete the ith Index row

In [38]:
my_df2.drop(2,axis=0)

    Name  Age  Year Nationality
0  Manoj   20  2012         IND
1    SAN   25  2013         USA
3    OPO   35  2015         JPN

In [39]:
my_df2 # means drop function not deleting permanently

    Name  Age  Year Nationality
0  Manoj   20  2012         IND
1    SAN   25  2013         USA
2    JAM   30  2014         CHN
3    OPO   35  2015         JPN

In [40]:
# As pandas does not delete permanently to avoid accidently loose the data, To Delete permanently we have to use 
# inplace=True

In [41]:
my_df2.drop(2,axis=0,inplace=True)

In [42]:
print(my_df2)

    Name  Age  Year Nationality
0  Manoj   20  2012         IND
1    SAN   25  2013         USA
3    OPO   35  2015         JPN

#### Selecting Rows in a DataFrame

In [43]:
my_df2.loc[0] # label Name means at my_df2.loc[2] will throw an error

Name           Manoj
Age               20
Year            2012
Nationality      IND
Name: 0, dtype: object

In [44]:
my_df2.iloc[2] # my_df2.loc[3] will throw an errro will work as by index

Name            OPO
Age              35
Year           2015
Nationality     JPN
Name: 3, dtype: object

In [45]:
#### Select the subset of rows and Column

In [46]:
my_df2.loc[0,'Name']

'Manoj'

In [47]:
my_df2.loc[0,'Age']

20

In [48]:
my_df2.loc[[0,1],['Name','Age']]

    Name  Age
0  Manoj   20
1    SAN   25

In [49]:
# Continue from Conditional selection using []

In [50]:
df3=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [51]:
df3

          W         X         Y         Z
A  0.667858 -1.938033  0.580591 -1.875219
B  1.060899  1.006770 -1.012033 -0.694001
C -0.872820  0.984816  0.607208  0.453074
D -0.568022  2.009633  1.083526  0.413144
E  0.110870  1.595489  1.165295  0.901272

In [52]:
# We need a data fram where W>0
df3[df3['W']>0]

          W         X         Y         Z
A  0.667858 -1.938033  0.580591 -1.875219
B  1.060899  1.006770 -1.012033 -0.694001
E  0.110870  1.595489  1.165295  0.901272

In [53]:
# Return values from x Only 
df3[df3['W']>0]['X']

A   -1.938033
B    1.006770
E    1.595489
Name: X, dtype: float64

In [54]:
df3[df3['W']>0][['X','Y']]

          X         Y
A -1.938033  0.580591
B  1.006770 -1.012033
E  1.595489  1.165295

#### Resetting the Index of a DataFrame

In [55]:
df3

          W         X         Y         Z
A  0.667858 -1.938033  0.580591 -1.875219
B  1.060899  1.006770 -1.012033 -0.694001
C -0.872820  0.984816  0.607208  0.453074
D -0.568022  2.009633  1.083526  0.413144
E  0.110870  1.595489  1.165295  0.901272

In [56]:
df3.reset_index()

  index         W         X         Y         Z
0     A  0.667858 -1.938033  0.580591 -1.875219
1     B  1.060899  1.006770 -1.012033 -0.694001
2     C -0.872820  0.984816  0.607208  0.453074
3     D -0.568022  2.009633  1.083526  0.413144
4     E  0.110870  1.595489  1.165295  0.901272

In [67]:
#df3.reset_index(inplace=True)

In [58]:
df3

  index         W         X         Y         Z
0     A  0.667858 -1.938033  0.580591 -1.875219
1     B  1.060899  1.006770 -1.012033 -0.694001
2     C -0.872820  0.984816  0.607208  0.453074
3     D -0.568022  2.009633  1.083526  0.413144
4     E  0.110870  1.595489  1.165295  0.901272

#### Setting the Index of a DataFrame

In [59]:
df3['ID']=['ID1','ID2','ID3','ID4','ID5']

In [60]:
df3

  index         W         X         Y         Z   ID
0     A  0.667858 -1.938033  0.580591 -1.875219  ID1
1     B  1.060899  1.006770 -1.012033 -0.694001  ID2
2     C -0.872820  0.984816  0.607208  0.453074  ID3
3     D -0.568022  2.009633  1.083526  0.413144  ID4
4     E  0.110870  1.595489  1.165295  0.901272  ID5

In [61]:
df3.set_index('ID')

    index         W         X         Y         Z
ID
ID1     A  0.667858 -1.938033  0.580591 -1.875219
ID2     B  1.060899  1.006770 -1.012033 -0.694001
ID3     C -0.872820  0.984816  0.607208  0.453074
ID4     D -0.568022  2.009633  1.083526  0.413144
ID5     E  0.110870  1.595489  1.165295  0.901272

#### MultiIndex from a tuple:

In [71]:
outside=['0-level','0-level','0-level','1-level','1-level','1-level']
inside=[21,22,23,21,22,23]
my_index=list(zip(outside,inside)) # Combined a list of tuples

In [72]:
my_index

[('0-level', 21),
 ('0-level', 22),
 ('0-level', 23),
 ('1-level', 21),
 ('1-level', 22),
 ('1-level', 23)]

#### using Multiindex.from_tuples(my_index)

In [75]:
my_index=pd.MultiIndex.from_tuples(my_index)

In [76]:
my_index

MultiIndex(levels=[['0-level', '1-level'], [21, 22, 23]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [77]:
df=pd.DataFrame(np.random.randn(6,2),index=my_index,columns=['A','B'])

In [78]:
df

                   A         B
0-level 21  1.160717  0.745107
        22 -1.346219  0.876893
        23  1.216782  0.814298
1-level 21  0.131251  1.074130
        22 -1.224234  0.809243
        23  0.552868 -0.319796

#### Missing Data

In [81]:
dt={'A':[1,np.nan,3],'B':[2,np.nan,np.nan],'C':[4,5,6]}

In [82]:
dt

{'A': [1, nan, 3], 'B': [2, nan, nan], 'C': [4, 5, 6]}

In [83]:
df=pd.DataFrame(dt)

In [84]:
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6